settings = {
    "id": 894952935442747393,
    "token": "ODk0OTUyOTM1NDQyNzQ3Mzkz.YVxf3w.n6J30jwGCdk7Jtr7dIOvtHAT0Og",
    "prefix": "!",
    "defaul_colour_of_embed": 0x42aaff
}

luckyRoleSettings = {
    "luckyRoleMax": 1000,
    "luckyRolePhraze": ["Посмотрим насколько ты удачливый! 🤩", "Кручу, верчу, удачу проверить твою хочу! 😏",
                        "Интересно, какое число тебе выпадет? <:imean:901497483002261525>", "Крутите барабан!",
                        "Хмм... <:thonk:908051482421633125>", "Ставлю все свои нейронные связи на то, что ты победишь) 😉"],
    "luckyRoleWinPhraze": ["О, повезло, повезло...", "Бинго!", "Impossible...", "WeeWee!", "Ес минус 3! УХУ!"],
    "luckyRoleChannelID": 924275377352871936
}

luckyRoles = {
    777: 924264011401400330,
    666: 924600112263618580,
    1: 924601345007296542,
    69: 926196128536473681,
    0: 926196382593847347,
    228: 926196539280470117,
    404: 926196775558201374,
    1000: 926196867400884404,
    911: 926197053921562764,
    999: 926197868795158528,
    456: 926360542547951656,
    737: 926360831153811486
}

santaSettings = {
    "santaRoleID": 926383093768654868
}