settings = {
    "isBetaVersion": False,
    "guild": 892493256129118260,
    "prefix": "ml/",
    "version": "1.0.1",
    "SDC_monitoring_token": "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6Ijg5NDk1MjkzNTQ0Mjc0NzM5MyIsInBlcm1zIjowLCJpYXQiOjE2NzE5OTA1NzR9.iKJCSmSik3xKrGJGi62pe4H3RLVNZAbirng1BMU_L20"
}

release_settings = {
    "id": 894952935442747393,
    "token": "ODk0OTUyOTM1NDQyNzQ3Mzkz.YVxf3w.mDITEPcJG6THaPHCiAyFE7Z_Akc",
    "application_id": 894952935442747393
}

beta_settings = {
    "id": 934900322634190878,
    "token": "OTM0OTAwMzIyNjM0MTkwODc4.GAJ4_g.jSSiA1xnuFmpQ80Kr5ub6LOS7gDRQFEen-VLl4",
    "application_id": 934900322634190878
}

db = {
    "username": "MLB1",
    "password": "xeB-QAG-44s-9c6"
}

luckyRoleSettings = {
    "luckyRoleMax": 100,
    "luckyRolePhraze": ["Посмотрим насколько ты удачливый! 🤩", "Кручу, верчу, удачу проверить твою хочу! 😏",
                        "Интересно, какое число тебе выпадет? <:imean:901497483002261525>", "Крутите барабан!",
                        "Хмм... <:thonk:908051482421633125>", "Ставлю все свои нейронные связи на то, что ты победишь) 😉"],
    "luckyRoleWinPhraze": ["О, повезло, повезло...", "Бинго!", "Impossible...", "WeeWee!", "Ес минус 3! УХУ!"],
    "luckyRoleChannelID": 924275377352871936,
    "artefacts_max_count": 12,
    "konch_artefacts_max_count": 12,
}

luckyRoles_list = {
    "lucky_role": 924264011401400330,
    "konch_role": 971036222845747200,
    "shnip_shnap": 971052313319976970,
    "ebola's_son": 971053012212654101,
    "el_primo": 971053703282962484
}

luckyRoles = {
    "lucky_role": [0, 924264011401400330, "lucky_artefacts", 12],
    "konch_role": [1, 971036222845747200, "konch_artefacts", 24],
    "shnip_shnap": [2, 971052313319976970, "shnip_shnap_artefacts", 3],
    "ebola's_son": [3, 971053012212654101, "ebolas_son_artefacts", 5],
    "el_primo": [4, 971053703282962484, "el_primo_artefacts", 3]
}

santaSettings = {
    "santaRoleID": 926383093768654868
}

economySettings = {
    "bannedChannelToGetMoney": [905415221793927198, 899672752494112829, 905417156211126295],
    "doubleMoneyChannel": [896440547990995075],
    "randomMoneyForMessageMin": 10,
    "randomMoneyForMessageMax": 25,
    "randomExpForMessageMin": 10,
    "randomExpForMessageMax": 25,
    "delayRewardSeconds": 10,
    "guild": 892493256129118260,
    "leaderBoardChannel": 939591886266580993,
    "success_color": 0x33FF66,
    "error_color": 0xff0000,
    "attention_color": 0xFFCC33,
    "monitoringReward": 25
}

roles_for_shop = {
    "Demon": 924600112263618580,
    "Reverse": 926196128536473681,
    "Blatnoy": 926196867400884404
}

meme_rus_settings = {
    "get_meme_phrases": ["Захотел мемчика? Я устрою! <a:trippepe:901514564900913262>",
                         "А вот для тебя весёлый подарочек... <a:trippepe:901514564900913262>",
                         "Пхах, прикинь чё нашёл... <a:trippepe:901514564900913262>",
                         "Нашёл что-то свеженькое для тебя!", "Любишь посмеяться?",
                         "Опа, а вот мемчик! <a:trippepe:901514564900913262>"],
    "guild": 892493256129118260,
    "moderationChannel": 944667843482484746,
    "meme_accepted_channel": 944899159121612831,
    "advise_phrases": ["💎 Опробуйте автопостинг мемов! Подробнее: /help", "❓ Если возникли трудности с ботом: /help",
                       "📨 Если вы хотите поделиться мемами со всеми, то исользуйте: /send_meme",
                       "📔 Теперь вы можете посмотреть свою статистику и уровень в мемном профиле: /profile",
                       "🚀 Хотите выделяться среди всех? Вы можете поддержать нашего бота! /plus_info"],
    "loading_phrases": ["можно поделиться своей идеей для бота в нашем официальном сервере?",
                        "создателем бота является EBOLA#1337",
                        "создателем лягушонка Pepe является Мэтт Фьюри",
                        "создатель бота любит играть в майнкрафт)",
                        "идею с созданием интересных фактов предложил Greydl#7150",
                        "бот был создан в феврале в качестве менеджера ивентов на сервере Meme Land",
                        "EBOLA любит кушать арбузики)",
                        "на официальном сервере бота проводятся розыгрыши, возможно тебе повезёт)",
                        "ещё в 2012 году обещали конец света, но мы так до сих пор его ждём...",
                        "а где видео-мемы?",
                        "с meme+ вы получите возможность сменить цвет у ваших мемов, ставить URL ссылки в мемы, а также показывать свой ник!",],
    "enable_ads": False
}
