settings = {
    "isBetaVersion": False,
    "id": 894952935442747393,
    "guild": 892493256129118260,
    "token": "ODk0OTUyOTM1NDQyNzQ3Mzkz.YVxf3w.n6J30jwGCdk7Jtr7dIOvtHAT0Og",
    "prefix": "!",
    "defaul_colour_of_embed": 0x42aaff
}

beta_settings = {
    "beta_id": 934900322634190878,
    "beta_token": "OTM0OTAwMzIyNjM0MTkwODc4.Ye2zxg.f4ElNKBOW5zuyAE-Y1nEW2CoH_E"
}

db = {
    "username": "MLB1",
    "password": "xeB-QAG-44s-9c6"
}

luckyRoleSettings = {
    "luckyRoleMax": 1000,
    "luckyRolePhraze": ["Посмотрим насколько ты удачливый! 🤩", "Кручу, верчу, удачу проверить твою хочу! 😏",
                        "Интересно, какое число тебе выпадет? <:imean:901497483002261525>", "Крутите барабан!",
                        "Хмм... <:thonk:908051482421633125>", "Ставлю все свои нейронные связи на то, что ты победишь) 😉"],
    "luckyRoleWinPhraze": ["О, повезло, повезло...", "Бинго!", "Impossible...", "WeeWee!", "Ес минус 3! УХУ!"],
    "luckyRoleChannelID": 924275377352871936
}

luckyRoles = {
    777: 924264011401400330,
    666: 924600112263618580,
    1: 924601345007296542,
    69: 926196128536473681,
    0: 926196382593847347,
    228: 926196539280470117,
    404: 926196775558201374,
    1000: 926196867400884404,
    911: 926197053921562764,
    999: 926197868795158528,
    737: 926360831153811486
}

santaSettings = {
    "santaRoleID": 926383093768654868
}

economySettings = {
    "bannedChannelToGetMoney": [905415221793927198, 899672752494112829, 905417156211126295],
    "doubleMoneyChannel": [896440547990995075],
    "randomMoneyForMessageMin": 10,
    "randomMoneyForMessageMax": 25,
    "delayRewardSeconds": 60,
    "guild": 892493256129118260,
    "leaderBoardChannel": 939591886266580993,
    "success_color": 0x33FF66,
    "error_color": 0xff0000,
    "attention_color": 0xFFCC33,
    "monitoringReward": 25
}

meme_rus_settings = {
    "get_meme_phrases": ["Захотел мемчика? Я устрою!", "А вот для тебя весёлый подарочек...", "Пхах, прикинь чё нашёл...",
                         "Нашёл что-то свеженькое для тебя!", "Любишь посмеяться?", "Опа, а вот мемчик!"],
    "guild": 892493256129118260,
    "moderationChannel": 944667843482484746,
    "meme_accepted_channel": 944899159121612831
}
