settings = {
    "id": 894952935442747393,
    "token": "ODk0OTUyOTM1NDQyNzQ3Mzkz.YVxf3w.n6J30jwGCdk7Jtr7dIOvtHAT0Og",
    "prefix": "!",
    "defaul_colour_of_embed": 0x42aaff
}

luckyRoleSettings = {
    "luckyRoleMax": 9999,
    "luckyRolePhraze": ["Посмотрим насколько ты удачливый! 🤩", "Кручу, верчу, удачу проверить твою хочу! 😏",
                        "Интересно, какое число тебе выпадет? <:imean:901497483002261525>", "Крутите барабан!",
                        "Хмм... <:thonk:908051482421633125>", "Ставлю все свои нейронные связи на то, что ты победишь) 😉"],
    "luckyRoleWinPhraze": ["О, повезло, повезло...", "Бинго!", "Impossible...", "WeeWee!", "Ес минус 3! УХУ!"],
    "luckyRoleID": 924264011401400330,
    "luckyRoleChannelID": 766386682047365194
}